In [2]:
import pandas as pd

In [3]:
obj=pd.Series([4,5,6,7])

In [4]:
obj

0    4
1    5
2    6
3    7
dtype: int64

In [5]:
obj.values

array([4, 5, 6, 7], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2=pd.Series(obj,index=['a','b','d','c'])

In [8]:
obj2

a   NaN
b   NaN
d   NaN
c   NaN
dtype: float64

In [9]:
obj2=pd.Series(obj.values,index=['a','b','d','c'])

In [10]:
obj2

a    4
b    5
d    6
c    7
dtype: int64

In [11]:
obj2[obj2>5]

d    6
c    7
dtype: int64

In [12]:
d in obj2

NameError: name 'd' is not defined

In [13]:
5 in obj2

False

In [14]:
'd' in obj2

True

In [15]:
6 in obj2

False

In [18]:
if ('d' in obj2):
    print(obj2['d'])

6

In [17]:
obj2['d']

6

In [19]:
pd.notnull(obj2)

a    True
b    True
d    True
c    True
dtype: bool

In [20]:
pd.isnull(obj2)

a    False
b    False
d    False
c    False
dtype: bool

In [21]:
obj2.isnull()

a    False
b    False
d    False
c    False
dtype: bool

In [22]:
obj2.notnull()

a    True
b    True
d    True
c    True
dtype: bool

In [24]:
data= {'state':['nawabshah','khi','khi','lhr','lhr','lhr','isl'],
        'year':[2001,2001,2002,2001,2002,2003,2001],
        'temp':[5,15,20,3,4,0,3]}

In [26]:
frame=pd.DataFrame(data)

In [27]:
frame

       state  year  temp
0  nawabshah  2001     5
1        khi  2001    15
2        khi  2002    20
3        lhr  2001     3
4        lhr  2002     4
5        lhr  2003     0
6        isl  2001     3

In [28]:
frame.head()

       state  year  temp
0  nawabshah  2001     5
1        khi  2001    15
2        khi  2002    20
3        lhr  2001     3
4        lhr  2002     4

In [29]:
pd.DataFrame(data,columns=['year','state','temp'])

   year      state  temp
0  2001  nawabshah     5
1  2001        khi    15
2  2002        khi    20
3  2001        lhr     3
4  2002        lhr     4
5  2003        lhr     0
6  2001        isl     3

In [34]:
df=pd.DataFrame(data,columns=['year','state','temp'],index=['a','b','c','e','f','d','a'])

In [35]:
df

   year      state  temp
a  2001  nawabshah     5
b  2001        khi    15
c  2002        khi    20
e  2001        lhr     3
f  2002        lhr     4
d  2003        lhr     0
a  2001        isl     3

In [36]:
df['eastern']=df.state='ohio'

In [37]:
df

   year state  temp eastern
a  2001  ohio     5    ohio
b  2001  ohio    15    ohio
c  2002  ohio    20    ohio
e  2001  ohio     3    ohio
f  2002  ohio     4    ohio
d  2003  ohio     0    ohio
a  2001  ohio     3    ohio

In [52]:
df['eastern']=range(7)

In [53]:
df

   year state  temp   pop  eastern
a  2001  ohio     5  1000        0
b  2001  ohio    15  2000        1
c  2002  ohio    20   500        2
e  2001  ohio     3   300        3
f  2002  ohio     4   120        4
d  2003  ohio     0   570        5
a  2001  ohio     3   800        6

In [45]:
#addition of a column in a data frame having same index
df['pop']=[1000,2000,500,300,120,570,800]

In [46]:
df

   year state  temp  eastern  easter   pop
a  2001  ohio     5        0       0  1000
b  2001  ohio    15        1       1  2000
c  2002  ohio    20        2       2   500
e  2001  ohio     3        3       3   300
f  2002  ohio     4        4       4   120
d  2003  ohio     0        5       5   570
a  2001  ohio     3        6       6   800

In [54]:
#deletion of a column 
del[df['eastern']]

In [55]:
df

   year state  temp   pop
a  2001  ohio     5  1000
b  2001  ohio    15  2000
c  2002  ohio    20   500
e  2001  ohio     3   300
f  2002  ohio     4   120
d  2003  ohio     0   570
a  2001  ohio     3   800

In [56]:
#transpose
df.T

          a     b     c     e     f     d     a
year   2001  2001  2002  2001  2002  2003  2001
state  ohio  ohio  ohio  ohio  ohio  ohio  ohio
temp      5    15    20     3     4     0     3
pop    1000  2000   500   300   120   570   800

In [59]:
df.index.name='Rows' ;df.columns.name='column'

In [60]:
df

column  year state  temp   pop
Rows
a       2001  ohio     5  1000
b       2001  ohio    15  2000
c       2002  ohio    20   500
e       2001  ohio     3   300
f       2002  ohio     4   120
d       2003  ohio     0   570
a       2001  ohio     3   800

In [68]:
# Reindex
import numpy as np
df1=pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','b','d'],columns=['year','stat','temp'])

In [69]:
df1

   year  stat  temp
a     0     1     2
b     3     4     5
d     6     7     8

In [70]:
df2=df1.reindex(['a','b','c','d'])

In [71]:
df2

   year  stat  temp
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   NaN   NaN   NaN
d   6.0   7.0   8.0